# Basics

## Initialisierung

In [78]:
import pandas as pd
from datetime import date, datetime
from sklearn import preprocessing

In [79]:
df = pd.DataFrame({"nam": ["Pers A", "Pers B", "Pers C"], "gebdat": [datetime(1974, 1, 1), datetime(1976, 1, 1), datetime(1979, 1, 1)], "stud": ["wahr", "falsch", "wahr"]})
df

      nam     gebdat    stud
0  Pers A 1974-01-01    wahr
1  Pers B 1976-01-01  falsch
2  Pers C 1979-01-01    wahr

## Projektionen
### Spalten umbenennen

In [80]:
df = df.rename(columns={"nam": "Name", "gebdat": "Geburtstag", "stud": "Student"})
df

     Name Geburtstag Student
0  Pers A 1974-01-01    wahr
1  Pers B 1976-01-01  falsch
2  Pers C 1979-01-01    wahr

### Spalte hinzuf√ºgen

In [81]:
today = date.today() 
def calculateAge(birthDate): 
    return today.year - birthDate.year - ((today.month, today.day) < (birthDate.month, birthDate.day))

df["Alter"] = df.Geburtstag.apply(calculateAge)
df

     Name Geburtstag Student  Alter
0  Pers A 1974-01-01    wahr     45
1  Pers B 1976-01-01  falsch     43
2  Pers C 1979-01-01    wahr     40

### Spalte entfernen

In [82]:
df = df.drop(columns=["Alter"])
df

     Name Geburtstag Student
0  Pers A 1974-01-01    wahr
1  Pers B 1976-01-01  falsch
2  Pers C 1979-01-01    wahr

## Wertkonvertierung

In [83]:
map = { "wahr": 1, "falsch": 0 }
df["Student"] = df["Student"].apply(lambda x: map[x])
df

     Name Geburtstag  Student
0  Pers A 1974-01-01        1
1  Pers B 1976-01-01        0
2  Pers C 1979-01-01        1

## Daten kombinieren

In [86]:
df2 = pd.DataFrame({"Name": ["Pers A", "Pers B", "Pers D"], "Ort": ["Bruneck", "Brixen", "Kufstein"]})
df2

     Name       Ort
0  Pers A   Bruneck
1  Pers B    Brixen
2  Pers D  Kufstein

### Inner Join

In [89]:
pd.merge(df, df2, left_on="Name", right_on="Name")

     Name Geburtstag  Student      Ort
0  Pers A 1974-01-01        1  Bruneck
1  Pers B 1976-01-01        0   Brixen

### Left outer join

In [92]:
pd.merge(df, df2, on="Name", how="left")

     Name Geburtstag  Student      Ort
0  Pers A 1974-01-01        1  Bruneck
1  Pers B 1976-01-01        0   Brixen
2  Pers C 1979-01-01        1      NaN